{
   "episodes": [
      {
         "title": "The Scientific Turnabout",
         "chapters": [
            {
               "title": "Trial Lobby",
               "content": [
                  {
                     "evidence": "new",
                     "id": "case-brief",
                     "name": "Case Brief",
                     "description": "The victim was killed while performing a chemistry experiment by an exploding test tube. Chemical burns and glass punctures were found on the body.",
                     "notification": false
                  },
                  {
                     "evidence": "new",
                     "id": "case-brief",
                     "name": "Case Brief",
                     "description": "The victim was killed while performing a chemistry experiment by an exploding test tube. Chemical burns and glass punctures were found on the body.",
                     "notification": false
                  },
                  {
                     "evidence": "new",
                     "id": "case-brief",
                     "name": "Case Brief",
                     "description": "The victim was killed while performing a chemistry experiment by an exploding test tube. Chemical burns and glass punctures were found on the body.",
                     "notification": false
                  },
                  {
                     "evidence": "new",
                     "id": "case-brief",
                     "name": "Case Brief",
                     "description": "The victim was killed while performing a chemistry experiment by an exploding test tube. Chemical burns and glass punctures were found on the body.",
                     "notification": false
                  },
                  {
                     "character": "$Rookie",
                     "speech": [
                        "##mode(thought)(My name is $Rookie, and I'm training to become a defence attorney.)",
                        "##mode(thought)(More specifically, I am a going to be a \"scientific attorney\"--and today is my first real case.)"
                     ]
                  },
                  {
                     "backdrop": "lobby.png",
                     "music": "lobby.mp3"
                  },
                  {
                     "character": "$Mentor",
                     "speech": [
                        "You know, you're quite brave to take on a murder trial as your first case.",
                        "After all, you pursued a degree in chemistry and law with the intent of defending patent rights, right?"
                     ]
                  },
                  {
                     "character": "$Rookie",
                     "speech": [
                        "Yeah… but I guess a murder trial is okay too.",
                        "The case is heavily involved in chemistry, after all."
                     ]
                  },
                  {
                     "character": "$Mentor",
                     "speech": [
                        "##mode(question)Oh, it does? How do you know that this case is chemistry-related? ##mode(normal)Show me some evidence from the Court Record."
                     ],
                     "evidence": "case-brief",
                     "wrong": [
                        {
                           "character": "$Mentor",
                           "speech": [
                              "Really? I fail to see how that answers my question."
                           ]
                        }
                     ]
                  },
                  {
                     "character": "Baliff",
                     "speech": [
                        "The trial will be starting in 5 minutes."
                     ]
                  },
                  {
                     "character": "$Mentor",
                     "speech": [
                        "Oh, then we better get going."
                     ]
                  }
               ]
            },
            {
               "title": "Trial Start",
               "content": [
                  {
                     "backdrop": "court",
                     "focus": "defence"
                  },
                  {
                     "transition": "pan",
                     "focus": "prosecution"
                  },
                  {
                     "character": "rookie",
                     "speech": [
                        "##mode(thought)(The prosecution seems to be ready…)"
                     ]
                  },
                  {
                     "sequence": "gavel"
                  },
                  {
                     "autotransition": true,
                     "set": {
                        "judge": "judge",
                        "defence": "rookie",
                        "prosecution": "prosecution",
                        "side": "mentor",
                        "stand": null
                     }
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Court is now in session for the trial of $Defendant.full.",
                        "Prosecution, are you ready?"
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "Of course, Your Honor."
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Defence, are you ready?"
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "Yes, Your Honor."
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Good.",
                        "Prosecution, if you would begin with your opening statement."
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "The prosecution would like to outline the facts about this case.",
                        "On September 19th, at approximately 1pm, the defendant and their lab partners were experimenting on a certain substance to determine its properties.",
                        "Their research was funded by the Kem & Hicals company (or K&H for short), who wanted to discover the properties of the substance.",
                        "The substance itself is a trade secret, and the court is gracious that K&H has provided it with some details about the substance.",
                        "Anyways, due to the defendant's malpractice, the lab tube exploded, killing the victim.",
                        "This is what the prosecution hopes to prove.",
                        "To explain the experiment better to the court, a reliable scientist is prepared to testify about it.",
                        "This scientist would also like to model the experiment on a whiteboard."
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Can someone please explain how to read one of these for less scientifically inclined?"
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "The prosecution would be delighted to.",
                        "Solid container walls are modeled with thick black lines. The particles in a substance--the things we care about--are modeled using a colored circle and a \"wooshie\".",
                        "This whooshie is just like a tail that indicates where the particle just came from.",
                        "When a whooshie is bent, it has just collided with another object.",
                        "The number of these bent wooshies (technically refered to as particle collisions) is how pressure is represented on our diagrams."
                     ]
                  },
                  {
                     "testimony": "experiment-explanation"
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "Did you make this whiteboard, witness?"
                     ]
                  },
                  {
                     "character": "witness",
                     "speech": [
                        "Yeah, I hastily drew this right now. Why are you asking me?"
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "Because there's a basic error in your work. Namely, the number of particle collision whooshies on the outside and inside are the same."
                     ]
                  },
                  {
                     "character": "witness",
                     "speech": [
                        "##mode(question)And why is this a problem?"
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "##mode(question)In order for the test tube to even have a chance at exploding…"
                     ],
                     "choices": [
                        {
                           "name": "The pressure on the outside would have to be greater than the pressure on the inside.",
                           "after": [
                              {
                                 "character": "defence",
                                 "speech": [
                                    "##mode(thought)(If the pressure was greater on the outside…",
                                    "...then wouldn't the lab tube ##mode(emphasis)##sound(question)implode##mode(thought)?)"
                                 ]
                              }
                           ]
                        },
                        {
                           "name": "The pressure on the inside would have to be greater than the pressure on the outside.",
                           "correct": true
                        },
                        {
                           "name": "The pressures would have to be equivalent.",
                           "after": [
                              {
                                 "character": "defence",
                                 "speech": [
                                    "##mode(thought)(Pressure is really just the way that we measure the collisions between air molecules and surfaces.)",
                                    "##mode(thought)(So, if both sides are recieving the same amount of collisions and therefore the same amount of force, how could one force overpower the other enough to break the tube?)"
                                 ]
                              }
                           ]
                        }
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "In order for the test tube to even have a chance at exploding, the inside pressure would have to be greater than the outside pressure. That is not indicated on your board."
                     ]
                  },
                  {
                     "character": "witness",
                     "speech": [
                        "And?##pause(short)##effect(smack)##speed(fast) Why does it matter? ##pause(short)A scientist doesn't have to model everything you know."
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "Well, it's a pretty crucial detail to omit. Also…"
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Such errors may cast doubt on your testimony later.",
                        "Anyways… would someone please explain what's going on for the less scientifically inclined?"
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "Oh, of course.",
                        "The prosecution says that the test tube exploded because the ##mode(emphasis)pressure##mode(normal) inside was too great. Remember that pressure in the tube is really just the collisions of air particles with the inside of the tube. So, if the pressure was too great, the particles would be able to apply so much force to the tube through collisions that the tube would break.",
                        "How the defendant actually deliberately made the pressure this dangerously high is what the prosecution needs to prove next."
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "Proving that the defendant did it should not be too difficult, you know. They call me a \"rookie killer\" for a reason.",
                        "I always try to end my cases in less than twenty minutes tops--"
                     ]
                  },
                  {
                     "sequence": "gavel"
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "Please stay on task, prosecution!"
                     ]
                  }
               ]
            },
            {
               "title": "Trial End",
               "content": [
                  {
                     "character": "judge",
                     "speech": [
                        "Ooooh! That green stuff looks just like the stuff from my grandson's science toy kit!"
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "If Your Honor could stay on task, the prosecution would very much appreciate it."
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "I think Your Honor would like it more if the prosecution was more respectful."
                     ]
                  },
                  {
                     "character": "prosecution",
                     "speech": [
                        "I think Your Honor would like it more if he realized that no one gives a flying flamingo about his grandson."
                     ]
                  },
                  {
                     "character": "judge",
                     "speech": [
                        "I think I'm prepared to render my verdict..."
                     ]
                  },
                  {
                     "character": "defence",
                     "speech": [
                        "##mode(thought)(I think Your Honor would like it more if we could get to the testimony.)"
                     ]
                  }
               ]
            }
         ]
      },
      {
         "title": "Turnabout for Futurity",
         "locked": true
      }
   ]
}